---
title: ScheduleHeightsOnSheet
classe: Autodesk.Revit.DB.ScheduleHeightsOnSheet
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ScheduleHeightsOnSheet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double ColumnHeaderHeight { get; }` | `scheduleHeightsOnSheet.ColumnHeaderHeight` | Double |
| `Boolean IsValidObject { get; }` | `scheduleHeightsOnSheet.IsValidObject` | Boolean |
| `Double TitleHeight { get; }` | `scheduleHeightsOnSheet.TitleHeight` | Double |
| `Void Dispose()` | `scheduleHeightsOnSheet.Dispose()` | Void |
| `IList<Double> GetBodyRowHeights()` | `scheduleHeightsOnSheet.GetBodyRowHeights()` | IList<Double> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```